КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиСвязейДокументов/КонтурЛогистика_НастройкиСвязейДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиСвязейДокументов</name>
  <comment>Все отборы сробатывают по И.</comment>
  <attributes>
    <name>ТипДокументаОсновной</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаПодчиненный</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПодчиненного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискаПодчиненногоВыражениеВычисления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКонвертацииПодчиненного</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборВыражениеВычисления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПутьККонтрагенту</name>
    <comment>По отношению к документу основания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетОснованияЗаполнения_СпособМаппинга</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетОснованияЗаполнения_ВыражениеВычисления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетОснованияЗаполнения_Расчитывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтборСтатусыТитулов</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборСтатусыДокументооборота</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборКонтрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СпособыМаппингаПоля/КонтурЛогистика_СпособыМаппингаПоля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СпособыМаппингаПоля</name>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеОбщейНастройки</name>
  </enumValues>
  <enumValues>
    <name>РеквизитДокументаОснования</name>
  </enumValues>
  <enumValues>
    <name>РеквизитЗаполненногоТитула</name>
  </enumValues>
  <enumValues>
    <name>ИзПредыдущегоТитула</name>
  </enumValues>
  <enumValues>
    <name>ВычислитьВыражение</name>
  </enumValues>
  <enumValues>
    <name>ДопСвойство</name>
  </enumValues>
  <enumValues>
    <name>ДопРеквизит</name>
  </enumValues>
  <enumValues>
    <name>НеЗаполнять</name>
  </enumValues>
  <enumValues>
    <name>РеквизитСправочникаДокументаУС</name>
  </enumValues>
  <enumValues>
    <name>Автоматически</name>
    <comment>по алгоритмам документооборота / дефолт / проч.</comment>
  </enumValues>
  <enumValues>
    <name>КонтактнаяИнформация</name>
  </enumValues>
  <enumValues>
    <name>ЗначенияСвойствОбъектов</name>
  </enumValues>
  <enumValues>
    <name>ДокументФизическогоЛица</name>
  </enumValues>
  <enumValues>
    <name>ДоговорыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ИзРодительскойНастройки</name>
    <comment>Позволит быстро менять вычисление реквизитов, не зависящих от связанного документа</comment>
  </enumValues>
  <enumValues>
    <name>РеквизитДополнительногоДокумента</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиСвязейДокументов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораПутьККонтрагенту();
	
	ОбновитьСписокВыбораРеквизитаДокусентаОснования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НайденныйЭлемент = Элементы.КонвертироватьИзДокумента.СписокВыбора.НайтиПоИдентификатору(0);
	НайденныйЭлемент.Представление = Строка(Объект.ТипДокументаОсновной);
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Объект.ПоискПодчиненного И Не Объект.ВводитьНаОсновании Тогда
		Сообщить("Необходимо выбрать хотя бы одно из действий (поиск, ввод на основании)");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДокументаОсновнойПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораПутьККонтрагенту();
	
	Объект.ОтборПутьККонтрагенту = "";
	
	НайденныйЭлемент = Элементы.КонвертироватьИзДокумента.СписокВыбора.НайтиПоИдентификатору(0);
	НайденныйЭлемент.Представление = Строка(Объект.ТипДокументаОсновной);
	
	Если ЗначениеЗаполнено(Объект.ТипДокументаОсновной) Тогда
		ОбновитьСписокВыбораРеквизитаДокусентаОснования();
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКонвертацииПодчиненногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТипДокумента1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(Объект.ТипДокументаОсновной);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипДокументаЛогистика", Объект.ТипДокументаПодчиненный);
	Отбор.Вставить("ТипДокумента1С", ТипДокумента1С);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ФормаВыбора", ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"НастройкиКонвертацииПодчиненногоНачалоВыбораЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКонвертацииПодчиненногоНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НастройкиКонвертацииПодчиненного = Результат;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПутьККонтрагентуПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентыПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПодчиненногоПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводитьНаОснованииПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискаПодчиненногоВыражениеВычисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстРедактирования = СтрЗаменить(Объект.ПоискаПодчиненногоВыражениеВычисления, "¶", Символы.ПС);
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьФормуРедактированияТекста(
		ТекстРедактирования, Объект, "ПоискаПодчиненногоВыражениеВычисления",,, "ДокументОсновной");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВыражениеВычисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьФормуРедактированияТекста(Объект.ОтборВыражениеВычисления,
	                                                                            Объект,
																				"ОтборВыражениеВычисления",,, "ДокументОсновной");
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьИзДокументаПриИзменении(Элемент)
	
	Объект.РасчетОснованияЗаполнения_Расчитывать = (КонвертироватьИзДокумента = 1);
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьИзДокумента1ПриИзменении(Элемент)
	
	Объект.РасчетОснованияЗаполнения_Расчитывать = (КонвертироватьИзДокумента = 1);
	
	Если Объект.РасчетОснованияЗаполнения_Расчитывать И Не ЗначениеЗаполнено(Объект.РасчетОснованияЗаполнения_СпособМаппинга) Тогда
		Объект.РасчетОснованияЗаполнения_СпособМаппинга =
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования");
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетОснованияЗаполнения_СпособМаппингаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.РасчетОснованияЗаполнения_СпособМаппинга) Тогда
		Объект.РасчетОснованияЗаполнения_СпособМаппинга =
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТипДокументаОсновной) Тогда
		ОбновитьСписокВыбораРеквизитаДокусентаОснования();
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораРеквизитаДокусентаОснования()
	
	Если Не ЗначениеЗаполнено(Объект.ТипДокументаОсновной) Тогда
		Элементы.РасчетОснованияЗаполнения_ВыражениеВычисления.СписокВыбора.ЗагрузитьЗначения(Новый Массив);
		Возврат;
	КонецЕсли;
	
	СпособРеквизитДокументаОснования = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования");
	Если Не ЗначениеЗаполнено(Объект.РасчетОснованияЗаполнения_СпособМаппинга) Тогда
		Объект.РасчетОснованияЗаполнения_СпособМаппинга = СпособРеквизитДокументаОснования;
	КонецЕсли;
	
	Если Объект.РасчетОснованияЗаполнения_СпособМаппинга = СпособРеквизитДокументаОснования Тогда
		
		ИмяДокумента = "КонтурЛогистика_" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(Объект.ТипДокументаОсновной);
		
		ИменаРеквизитов = Новый Массив;
		Для Каждого ТекущийРеквизит Из Метаданные.Документы[ИмяДокумента].Реквизиты Цикл
			ИменаРеквизитов.Добавить(ТекущийРеквизит.Имя);
		КонецЦикла;
		
		Элементы.РасчетОснованияЗаполнения_ВыражениеВычисления.СписокВыбора.ЗагрузитьЗначения(ИменаРеквизитов);
		
	Иначе
		
		Элементы.РасчетОснованияЗаполнения_ВыражениеВычисления.СписокВыбора.ЗагрузитьЗначения(Новый Массив);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетОснованияЗаполнения_ВыражениеВычисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.РасчетОснованияЗаполнения_СпособМаппинга =
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстРедактирования = СтрЗаменить(Объект.РасчетОснованияЗаполнения_ВыражениеВычисления, "¶", Символы.ПС);
		
		КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьФормуРедактированияТекста(
			ТекстРедактирования, Объект, "РасчетОснованияЗаполнения_ВыражениеВычисления");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРедактированиеСтрокиВДопФорме(ВыбранноеЗначение = Неопределено, ИмяЭлемента = Неопределено) Экспорт

	//Если ВыбранноеЗначение <> Неопределено И ТипЗнч(ВыбранноеЗначение) = тип("Структура") И ИмяЭлемента <> Неопределено Тогда
	//	
	//	Модифицированность = Истина;
	//	
	//	Если ТипЗнч(Элементы[ИмяЭлемента]) = Тип("ТаблицаФормы") Тогда 
	//		ТабФормы  = Элементы[ИмяЭлемента];
	//	Иначе
	//		ТабФормы  = Элементы[ИмяЭлемента].Родитель.Родитель;
	//	КонецЕсли;

	//	ТабФормы.ТекущиеДанные.СпособМаппинга 					= ВыбранноеЗначение.СпособМаппинга;
	//	ТабФормы.ТекущиеДанные.ВыражениеВычисления 				= ВыбранноеЗначение.ВыражениеВычисления;
	//	ТабФормы.ТекущиеДанные.ВыражениеВычисления2 			= ВыбранноеЗначение.ВыражениеВычисления2;
	//	ТабФормы.ТекущиеДанные.ВыражениеВычисленияСтрокаНеогр	= ВыбранноеЗначение.ВыражениеВычисленияСтрокаНеогр;
	//	ТабФормы.ТекущиеДанные.КлючДопСвойстваРеквизита 		= ВыбранноеЗначение.КлючДопСвойстваРеквизита;
	//	ТабФормы.ТекущиеДанные.СвойствоОбъекта 					= ВыбранноеЗначение.СвойствоОбъекта;
	//	
	//	Если ТабФормы.Имя = "Переменные" Тогда 
	//		Если ВыбранноеЗначение.СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ФиксированноеЗначение") 
	//			И ЗначениеЗаполнено(ВыбранноеЗначение.ВыражениеВычисления) 
	//			И Не ЗначениеЗаполнено(ТабФормы.ТекущиеДанные.ИмяТипЗначения) Тогда  	
	//			ТабФормы.ТекущиеДанные.ИмяТипЗначения = Строка(ТипЗНЧ(ВыбранноеЗначение.ВыражениеВычисления))
	//		Иначе	
	//			ТабФормы.ТекущиеДанные.ИмяТипЗначения = "";
	//		КонецЕсли; 
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Элементы.ПравилаКонвертацииТитулаТабЧастьПроизвольная.ЗакончитьРедактированиеСтроки(Ложь);	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.ОтборКонтрагентыПредупреждение.Видимость =
		(Объект.ОтборКонтрагенты.Количество() <> 0 И Не ЗначениеЗаполнено(Объект.ОтборПутьККонтрагенту));
	
	Элементы.ПоискаПодчиненногоВыражениеВычисления.Видимость = Объект.ПоискПодчиненного;
	Элементы.ГруппаВводНаОснованииЭтап1.Видимость = Объект.ВводитьНаОсновании;
	Элементы.ГруппаВводНаОснованииЭтап2.Видимость = Объект.ВводитьНаОсновании;
	
	Если Объект.РасчетОснованияЗаполнения_Расчитывать Тогда
		КонвертироватьИзДокумента = 1;
	Иначе
		КонвертироватьИзДокумента = 0;
	КонецЕсли;
	
	Элементы.РасчетОснованияЗаполнения_СпособМаппинга.Доступность = Объект.РасчетОснованияЗаполнения_Расчитывать;
	Элементы.РасчетОснованияЗаполнения_ВыражениеВычисления.Доступность = Объект.РасчетОснованияЗаполнения_Расчитывать;
	
	МаппингВычислитьВыражение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение");
	Если Объект.РасчетОснованияЗаполнения_СпособМаппинга = МаппингВычислитьВыражение Тогда
		Элементы.РасчетОснованияЗаполнения_ВыражениеВычисления.КнопкаВыпадающегоСписка = Неопределено;
		Элементы.РасчетОснованияЗаполнения_ВыражениеВычисления.КнопкаВыбора = Истина;
	Иначе
		Элементы.РасчетОснованияЗаполнения_ВыражениеВычисления.КнопкаВыпадающегоСписка = Истина;
		Элементы.РасчетОснованияЗаполнения_ВыражениеВычисления.КнопкаВыбора = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПутьККонтрагенту()
	
	ЗначенияПутейККонтрагенту = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ТипДокументаОсновной) Тогда
		
		// Из главного документа
		ИмяГлавного = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ИмяОсновногоДокументаДляТипаЛогистики(Объект.ТипДокументаОсновной);
		Если ЗначениеЗаполнено(ИмяГлавного) Тогда
			ИмяГлавногоДокумента = "КонтурЛогистика_" + ИмяГлавного;
			ИмяРеквизитаГлавного = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ИмяРеквизитаГлавногооДокумента(Объект.ТипДокументаОсновной);
			ДополнитьЗначенияПутейККонтрагенту(ЗначенияПутейККонтрагенту, ИмяГлавногоДокумента, ИмяРеквизитаГлавного);
		КонецЕсли;
		
		// Из основного документа
		ИмяТекущего = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(Объект.ТипДокументаОсновной);
		ИмяТекущегоДокумента = "КонтурЛогистика_" + ИмяТекущего;
		ДополнитьЗначенияПутейККонтрагенту(ЗначенияПутейККонтрагенту, ИмяТекущегоДокумента, "");
	
	КонецЕсли;
	
	Элементы.ОтборПутьККонтрагенту.СписокВыбора.ЗагрузитьЗначения(ЗначенияПутейККонтрагенту);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьЗначенияПутейККонтрагенту(ЗначенияПутейККонтрагенту, ИмяДокумента, ИмяРеквизитаГлавного)
	
	ТипКонтрагента = Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок");
	
	Для Каждого ТекущийРеквизит Из Метаданные.Документы[ИмяДокумента].Реквизиты Цикл
		Если ТекущийРеквизит.Тип <> ТипКонтрагента Тогда
			Продолжить;
		КонецЕсли;
		
		ПутейККонтрагенту = ТекущийРеквизит.Имя;
		
		Если ЗначениеЗаполнено(ИмяРеквизитаГлавного) Тогда
			ПутейККонтрагенту = ИмяРеквизитаГлавного + "." + ПутейККонтрагенту;
		КонецЕсли;
		
		ЗначенияПутейККонтрагенту.Добавить(ПутейККонтрагенту);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
